package random_fields

import "math/rand"

var itemTypes = []string{
	"Смартфон",
	"Ноутбук",
	"Наушники",
	"Книги",
	"Одежда",
	"Мебель",
	"Продукты питания",
	"Бытовая техника",
	"Игрушки",
	"Ювелирные изделия",
	"Спортивные товары",
	"Инструменты",
	"Лекарства",
	"Косметика",
	"Канцелярия",
	"Обувь",
	"Часы",
	"Аксессуары",
	"Подарки",
	"Садовый инвентарь",
	"Автозапчасти",
	"Электроника",
	"Посуда",
	"Текстиль",
	"Декоративные предметы",
	"Игры и пазлы",
	"Музыкальные инструменты",
	"Зоотовары",
	"Кухонная техника",
	"Строительные материалы",
	"Хозяйственные товары",
	"Средства гигиены",
	"Рыболовные принадлежности",
	"Товары для детей",
	"Косметические аксессуары",
	"Путешествия и туризм",
	"Охота и рыбалка",
	"Электротехника",
	"Книги по саморазвитию",
	"Программное обеспечение",
}

func RandomItemType() string {
	return itemTypes[rand.Intn(len(itemTypes))]
}
