package random_fields

import "math/rand"

// Мужские имена
var maleFirstNames = []string{
	"Алексей", "Дмитрий", "Иван", "Николай", "Павел", "Владимир", "Андрей", "Сергей", "Александр", "Максим",
	"Михаил", "Роман", "Василий", "Георгий", "Кирилл", "Олег", "Степан", "Егор", "Константин", "Аркадий",
	"Леонид", "Анатолий", "Григорий", "Юрий", "Виталий", "Виктор", "Артур", "Борис", "Владислав", "Евгений",
	"Даниил", "Никита", "Фёдор", "Семен", "Ярослав", "Артем", "Тимофей", "Геннадий", "Игнат", "Альберт",
	"Рустам", "Глеб", "Лев", "Руслан", "Захар", "Тимур", "Родион", "Денис", "Арсений", "Эдуард",
	"Вениамин", "Давид", "Эмиль", "Азамат", "Роман", "Дамир", "Станислав", "Ян", "Марат", "Тихон",
	"Антон", "Елисей", "Всеволод", "Вадим", "Анатолий", "Эльдар", "Варфоломей", "Филипп", "Альфред", "Трофим",
	"Платон", "Дамьян",
}

// Женские имена
var femaleFirstNames = []string{
	"Мария", "Ольга", "Екатерина", "Анна", "Елена", "Татьяна", "Юлия", "Галина", "Любовь", "Анастасия",
	"Виктория", "Дарья", "Надежда", "Алёна", "Марина", "Евгения", "Зоя", "Лариса", "Валентина", "Светлана",
	"Кристина", "Нина", "Полина", "Алиса", "Варвара", "Ксения", "Инна", "Ирина", "Елизавета", "Оксана",
	"Тамара", "Вероника", "Арина", "Милана", "Эльвира", "Агата", "Виолетта", "Лилия", "Эвелина", "Диана",
	"Яна", "Снежана", "Ева", "Людмила", "Регина", "Викторина", "Юлиана", "Нелли", "Гелена", "Таисия",
	"Лиана", "Олеся", "Антонина", "Кира", "Зинаида", "Рената", "Карина", "Мира", "Злата", "Лидия",
	"Есения", "Аврора", "Мия", "Аделина", "Валентина", "Эрика", "Майя", "Дина", "Алия", "Ия",
}

// Мужские отчества
var maleMiddleNames = []string{
	"Александрович", "Иванович", "Петрович", "Дмитриевич", "Николаевич",
	"Владимирович", "Алексеевич", "Сергеевич", "Викторович", "Михайлович",
	"Юрьевич", "Евгеньевич", "Васильевич", "Максимович", "Олегович",
	"Анатольевич", "Валерьевич", "Константинович", "Борисович", "Геннадьевич",
	"Григорьевич", "Валентинович", "Аркадьевич", "Ильич", "Фёдорович",
	"Павлович", "Романович", "Егорович", "Степанович", "Никитич",
	"Захарович", "Яковлевич", "Львович", "Андреевич", "Игнатьевич",
	"Кириллович", "Тимофеевич", "Георгиевич", "Альбертович", "Эдуардович",
	"Артемович", "Ефимович", "Вениаминович", "Анатольевич", "Всеволодович",
	"Вячеславович", "Леонидович", "Игоревич", "Русланович", "Станиславович",
	"Родионович", "Арсеньевич", "Данилович", "Семенович", "Филиппович",
	"Ефремович", "Тихонович", "Прохорович", "Игнатович", "Глебович",
	"Еремеевич", "Лукьянович", "Трофимович", "Платонович", "Миронович",
}

// Женские отчества
var femaleMiddleNames = []string{
	"Александровна", "Ивановна", "Петровна", "Дмитриевна", "Николаевна",
	"Владимировна", "Алексеевна", "Сергеевна", "Викторовна", "Михайловна",
	"Юрьевна", "Евгеньевна", "Васильевна", "Максимовна", "Олеговна",
	"Анатольевна", "Валерьевна", "Константиновна", "Борисовна", "Геннадьевна",
	"Григорьевна", "Валентиновна", "Аркадьевна", "Ильинична", "Фёдоровна",
	"Павловна", "Романовна", "Егоровна", "Степановна", "Никитишна",
	"Захаровна", "Яковлевна", "Львовна", "Андреевна", "Игнатьевна",
	"Кирилловна", "Тимофеевна", "Георгиевна", "Альбертовна", "Эдуардовна",
	"Артемовна", "Ефимовна", "Вениаминовна", "Анатольевна", "Всеволодовна",
	"Вячеславовна", "Леонидовна", "Игоревна", "Руслановна", "Станиславовна",
	"Родионовна", "Арсеньевна", "Даниловна", "Семеновна", "Филипповна",
	"Ефремовна", "Тихоновна", "Прохоровна", "Игнатовна", "Глебовна",
	"Еремеевна", "Лукьяновна", "Трофимовна", "Платоновна", "Мироновна",
}

var russianLastNames = []string{
	"Иванов", "Петров", "Смирнов", "Кузнецов", "Попов", "Соколов", "Лебедев", "Козлов", "Новиков", "Морозов",
	"Волков", "Соловьев", "Васильев", "Зайцев", "Павлов", "Семенов", "Голубев", "Виноградов", "Богданов", "Воробьев",
	"Федоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселев", "Макаров", "Андреев",
	"Ковалев", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов",
	"Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королев", "Герасимов", "Пономарев", "Григорьев",
	"Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков",
	"Фролов", "Журавлев", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев",
	"Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров",
	"Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков",
	"Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников",
	"Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов",
	"Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов",
	"Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов", "Овчинников", "Селезнев",
	"Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов", "Лукьянов", "Беляков", "Потапов", "Некрасов",
	"Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов",
}

func GenerateRussianFirstName() string {
	if rand.Intn(2) == 0 { // 50% вероятность выбора мужского имени
		return maleFirstNames[rand.Intn(len(maleFirstNames))]
	}
	return femaleFirstNames[rand.Intn(len(femaleFirstNames))]
}

func GenerateRussianLastName() string {
	return russianLastNames[rand.Intn(len(russianLastNames))]
}

func getGenderByName(firstName string) string {
	for _, name := range maleFirstNames {
		if name == firstName {
			return "male"
		}
	}
	return "female" // Если имя не найдено среди мужских, считаем женским
}

func GenerateMiddleNameByFirstName(firstName string) string {
	gender := getGenderByName(firstName)
	if gender == "male" {
		return maleMiddleNames[rand.Intn(len(maleMiddleNames))]
	}
	return femaleMiddleNames[rand.Intn(len(femaleMiddleNames))]
}
